app/Controllers/Clientes.php

SELECT *
FROM `clientes`
WHERE `activo` = 1
---
    public function index($activo = 1)
    {
        $clientes = $this->clientes->where('activo',$activo)->findAll();

SELECT *
FROM `clientes`
WHERE `id` = '11'
 LIMIT 1
---
    public function editar($id)
    {
        $cliente= $this->clientes->where('id', $id)->first();

UPDATE `clientes` SET `nombre` = 'Zulma', `direccion` = 'cusco', `telefono` = '94357343', `correo` = 'zulma@123.com', `edad` = '21', `fecha_edit` = '2023-01-18 19:28:53'
WHERE `clientes`.`id` IN ('11')
---
    public function actualizar()
    {
        $this->clientes->update(
            $this->request->getPost('id'),
            ['nombre' => $this->request->getPost('nombre'),
            'direccion' => $this->request->getPost('direccion'),
            'telefono' => $this->request->getPost('telefono'),
            'correo' => $this->request->getPost('correo')]);