app/Controllers/Configuracion.php

    public function index($activo = 1)
    {
        $nombre = $this->configuracion->where('nombre', 'tienda_nombre')->first();
        $rfc = $this->configuracion->where('nombre', 'tienda_rfc')->first();
        $telefono = $this->configuracion->where('nombre', 'tienda_telefono')->first();
        $email = $this->configuracion->where('nombre', 'tienda_email')->first();
        $direccion = $this->configuracion->where('nombre', 'tienda_direccion')->first();
        $leyenda = $this->configuracion->where('nombre', 'ticket_leyenda')->first();
---
SELECT *
FROM `configuracion`
WHERE `nombre` = 'tienda_nombre'
 LIMIT 1
SELECT *
FROM `configuracion`
WHERE `nombre` = 'tienda_rfc'
 LIMIT 1
SELECT *
FROM `configuracion`
WHERE `nombre` = 'tienda_telefono'
 LIMIT 1
SELECT *
FROM `configuracion`
WHERE `nombre` = 'tienda_email'
 LIMIT 1
SELECT *
FROM `configuracion`
WHERE `nombre` = 'tienda_direccion'
 LIMIT 1
SELECT *
FROM `configuracion`
WHERE `nombre` = 'ticket_leyenda'
 LIMIT 1

    public function actualizar()
    {
        if($this->request->getMethod() == "post" && $this->validate( $this->reglas)){

            $this->configuracion->whereIn('nombre', ['tienda_nombre'])->set(['valor'=>
            $this->request->getPost('tienda_nombre')])->update();

            $this->configuracion->whereIn('nombre', ['tienda_rfc'])->set(['valor'=>
            $this->request->getPost('tienda_rfc')])->update();

            $this->configuracion->whereIn('nombre', ['tienda_telefono'])->set(['valor'=>
            $this->request->getPost('tienda_telefono')])->update();

            $this->configuracion->whereIn('nombre', ['tienda_email'])->set(['valor'=>
            $this->request->getPost('tienda_email')])->update();

            $this->configuracion->whereIn('nombre', ['tienda_direccion'])->set(['valor'=>
            $this->request->getPost('tienda_direccion')])->update();

            $this->configuracion->whereIn('nombre', ['ticket_leyenda'])->set(['valor'=>
            $this->request->getPost('ticket_leyenda')])->update();
---
UPDATE `configuracion` SET `valor` = 'Tienda CDP'
WHERE `nombre` IN ('tienda_nombre')
UPDATE `configuracion` SET `valor` = 'XXAXX000000XXX'
WHERE `nombre` IN ('tienda_rfc')
UPDATE `configuracion` SET `valor` = '65321654'
WHERE `nombre` IN ('tienda_telefono')
UPDATE `configuracion` SET `valor` = 'tienda@cdp.com'
WHERE `nombre` IN ('tienda_email')
UPDATE `configuracion` SET `valor` = 'Avenida avenito juarez'
WHERE `nombre` IN ('tienda_direccion')
UPDATE `configuracion` SET `valor` = 'Gracias por comprar'
WHERE `nombre` IN ('ticket_leyenda')