app/Controllers/Logs.php

SELECT *
FROM `logs`
WHERE `id_usuario` = '6'
---
    public function index()
    {
        $session = session();
        $logs = $this->logs->where('id_usuario', $session->id_usuario)->findAll();