app/Controllers/Productos.php

SELECT *
FROM `productos`
WHERE `activo` = 1
---
    public function index($activo = 1)
    {
        $permiso = $this->detalleRoles->verificaPermisos($this->session->id_rol, 'ProductosCatalogo');

        if(!$permiso){
            echo 'No tiene permiso';
            exit;
        }

        $productos = $this->productos->where('activo',$activo)->findAll();

SELECT *
FROM `unidades`
WHERE `activo` = 1
SELECT *
FROM `categorias`
WHERE `activo` = 1
---
    public function nuevo()
    {
        $unidades = $this->unidades->where('activo', 1)->findAll();
        $categorias = $this->categorias->where('activo', 1)->findAll();

SELECT *
FROM `productos`
WHERE `codigo` LIKE '%123%' ESCAPE '!'
AND `activo` = 1
---
    public function autocompleteData(){

        $returnData = array();

        $valor = $this->request->getGet('term');

        $productos = $this->productos->like('codigo', $valor)->where('activo', 1)->findAll();