app/Controllers/Roles.php

SELECT *
FROM `roles`
WHERE `activo` = 1
---
    public function index($activo = 1)
    {
        $roles = $this->roles->where('activo',$activo)->findAll();