app/Controllers/TemporalCompra.php

SELECT *
FROM `productos`
WHERE `id` = '1'
 LIMIT 1
---
    public function inserta($id_producto, $cantidad, $id_compra)
    {
        $error = '';
        $producto = $this->productos->where('id', $id_producto)->first();