app/Controllers/Usuarios.php

    public function valida(){
        if($this->request->getMethod() == "post" && $this->validate( $this->reglasLogin)){
            $usuario = $this->request->getPost('usuario');
            $password = $this->request->getPost('password');
            $datoUsuario = $this->usuarios->where('usuario', $usuario)->first();
---
SELECT *
FROM `usuarios`
WHERE `usuario` = 'juan'
 LIMIT 1

    public function logout(){
        $session = session();

        $ip = $_SERVER['REMOTE_ADDR'];
        $detalles = $_SERVER['HTTP_USER_AGENT'];

        $this->logs->save([
            'id_usuario' =>  $session->id_usuario,
            'evento' => 'Cierre de sesión',
            'ip' => $ip,
            'detalles' => $detalles
        ]);
---
INSERT INTO `logs` (`id_usuario`, `evento`, `ip`, `detalles`, `fecha`) VALUES ('6', 'Cierre de sesión', '192.168.0.104', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/108.0.0.0 Safari/537.36', '2023-01-09 08:18:05')