app/Controllers/Ventas.php

    function generaTicket($id_venta){
        $datosVenta = $this->ventas->where('id', $id_venta)->first();
        $detalleVenta = $this->detalle_venta->select('*')->where('id_venta', $id_venta)->findAll();

        $nombreTienda = $this->configuracion->select('valor')->where('nombre', 'tienda_nombre')->get()->getRow()->valor;
        $direccionTienda = $this->configuracion->select('valor')->where('nombre', 'tienda_direccion')->get()->getRow()->valor;
        $leyendaTicket = $this->configuracion->select('valor')->where('nombre', 'ticket_leyenda')->get()->getRow()->valor;
---
SELECT *
FROM `ventas`
WHERE `id` = '36'
 LIMIT 1
SELECT *
FROM `detalle_venta`
WHERE `id_venta` = '36'
SELECT `valor`
FROM `configuracion`
WHERE `nombre` = 'tienda_nombre'
SELECT `valor`
FROM `configuracion`
WHERE `nombre` = 'tienda_direccion'
SELECT `valor`
FROM `configuracion`
WHERE `nombre` = 'ticket_leyenda'