app/Models/ProductosModel.php

SELECT COUNT(*) AS `numrows`
FROM `productos`
WHERE `activo` = 1
---
    public function totalProductos(){
        return $this->where('activo', 1)->countAllResults();

SELECT *
FROM `productos`
WHERE `stock_minimo` >= existencias AND `inventariable` = 1 AND `activo` = 1
---
    public function getProductosMinino(){
        $where = "stock_minimo >= existencias AND inventariable=1 AND activo=1";
        return $this->where($where)->findAll();