app/Models/TemporalCompraModel.php

    public function actualizarProductoCompra($id_producto, $folio, $cantidad, $subtotal){
        $this->set('cantidad', $cantidad);
        $this->set('subtotal', $subtotal);
        $this->where('id_producto', $id_producto);
        $this->where('folio', $folio);
        $this->update();
---
UPDATE `temporal_compra` SET `cantidad` = 2, `subtotal` = 32
WHERE `id_producto` = '21'
AND `folio` = '63b5f5ec818b9'